; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v3)
             (pred_6 ?v1 ?v4)
             (pred_9 ?v6 ?v4)
             (pred_4 ?v13 ?v6 )
	     (pred_7 ?v6)
             (pred_5 ?v2)
             (pred_2 ?v1)
             (pred_1 ?v4)
             (pred_3 ?v6)
             (pred_8 ?v1)
             (pred_10 ?v6)
             (pred_12 ))



(:action op_3
:parameters (?v9 ?v8 ?v12 ?v7)
:precondition (and (pred_5 ?v9) (pred_5 ?v8) (pred_2 ?v12) (pred_1 ?v7)
          (pred_11 ?v9 ?v8) (pred_6 ?v12 ?v7)
                   (pred_9 ?v8 ?v7) (pred_7 ?v9) 
                   (pred_3 ?v8) (pred_8 ?v12))
:effect (and  (pred_10 ?v8) (not (pred_3 ?v8))))


(:action op_1
:parameters (?v9 ?v5)
:precondition (and (pred_5 ?v9) (pred_5 ?v5)
               (pred_7 ?v9) (pred_11 ?v9 ?v5) (pred_10 ?v5))
:effect (and (pred_7 ?v5) (not (pred_7 ?v9))))

(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_5 ?v9) (pred_2 ?v12) 
                  (pred_7 ?v9) (pred_4 ?v12 ?v9) (pred_12 ))
:effect (and (pred_8 ?v12)
   (not (pred_4 ?v12 ?v9)) (not (pred_12 ))))


(:action op_5
:parameters (?v9 ?v11 ?v10)
:precondition (and (pred_5 ?v9) (pred_2 ?v11) (pred_2 ?v10)
                  (pred_7 ?v9) (pred_8 ?v10) (pred_4 ?v11 ?v9))
:effect (and (pred_8 ?v11) (pred_4 ?v10 ?v9)
        (not (pred_8 ?v10)) (not (pred_4 ?v11 ?v9))))

(:action op_2
:parameters (?v9 ?v12)
:precondition (and (pred_5 ?v9) (pred_2 ?v12) 
                  (pred_7 ?v9) (pred_8 ?v12))
:effect (and (pred_12 ) (pred_4 ?v12 ?v9) (not (pred_8 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_31 obj_22 obj_17 obj_13 obj_11 obj_24 obj_03 obj_23 obj_20 obj_04 obj_21 obj_09 obj_28 obj_12 obj_16 obj_25 obj_15 obj_08 obj_01 obj_29 obj_26 obj_06 obj_05 obj_02 obj_07
    obj_18 obj_10 obj_19
    obj_14 obj_30 obj_27
    )

    (:init
       (pred_12)

       (pred_5 obj_31)
       (pred_5 obj_22)
       (pred_5 obj_17)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_24)
       (pred_5 obj_03)
       (pred_5 obj_23)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_21)
       (pred_5 obj_09)
       (pred_5 obj_28)
       (pred_5 obj_12)
       (pred_5 obj_16)
       (pred_5 obj_25)
       (pred_5 obj_15)
       (pred_5 obj_08)
       (pred_5 obj_01)
       (pred_5 obj_29)
       (pred_5 obj_26)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_02)
       (pred_5 obj_07)
       (pred_1 obj_18)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_30)
       (pred_2 obj_27)

       (pred_11 obj_31 obj_24)
       (pred_11 obj_31 obj_22)
       (pred_11 obj_22 obj_03)
       (pred_11 obj_22 obj_17)
       (pred_11 obj_22 obj_31)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_22)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_13 obj_11)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_13)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_03)
       (pred_11 obj_24 obj_31)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_03 obj_22)
       (pred_11 obj_03 obj_24)
       (pred_11 obj_23 obj_28)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_20 obj_04)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_04 obj_20)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_09 obj_15)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_28 obj_12)
       (pred_11 obj_28 obj_23)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_28)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_25 obj_15)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_09)
       (pred_11 obj_15 obj_25)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_29 obj_07)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_26 obj_06)
       (pred_11 obj_26 obj_25)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_26)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_07 obj_29)
       (pred_11 obj_07 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_31)
       (pred_3 obj_28)
       (pred_9  obj_04 obj_18)
       (pred_9  obj_31 obj_10)
       (pred_9  obj_28 obj_19)
       (pred_10 obj_22)
       (pred_10 obj_17)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_24)
       (pred_10 obj_03)
       (pred_10 obj_23)
       (pred_10 obj_20)
       (pred_10 obj_21)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_16)
       (pred_10 obj_25)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_01)
       (pred_10 obj_29)
       (pred_10 obj_26)
       (pred_10 obj_06)
       (pred_10 obj_05)
       (pred_10 obj_02)
       (pred_10 obj_07)

       (pred_6  obj_14 obj_18)
       (pred_6  obj_30 obj_10)
       (pred_6  obj_27 obj_19)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_30 obj_29)
       (pred_4 obj_27 obj_17)
       (pred_7 obj_26)
    )

    (:goal (and
       (pred_4 obj_14 obj_15)
       (pred_4 obj_30 obj_07)
       (pred_4 obj_27 obj_05)
    ))
(:constraints
  (always (not (pred_7 obj_01)))
)
)

; plan
1. (op_1 obj_26 obj_25)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_25)
   goals met: 0 of 3
2. (op_1 obj_25 obj_15)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_15)
   goals met: 0 of 3
3. (op_1 obj_15 obj_09)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_09)
   goals met: 0 of 3
4. (op_1 obj_09 obj_03)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_03)
   goals met: 0 of 3
5. (op_1 obj_03 obj_23)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_23)
   goals met: 0 of 3
6. (op_1 obj_23 obj_20)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_20)
   goals met: 0 of 3
7. (op_1 obj_20 obj_12)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_12)
   goals met: 0 of 3
8. (op_1 obj_12 obj_16)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_16)
   goals met: 0 of 3
9. (op_1 obj_16 obj_29)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_29)
   goals met: 0 of 3
10. (op_4 obj_29 obj_30)
   deleted: (pred_4 obj_30 obj_29) (pred_12)
   added: (pred_8 obj_30)
   goals met: 0 of 3
11. (op_1 obj_29 obj_07)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_07)
   goals met: 0 of 3
12. (op_2 obj_07 obj_30)
   deleted: (pred_8 obj_30)
   added: (pred_12) (pred_4 obj_30 obj_07)
   goals met: 1 of 3
13. (op_1 obj_07 obj_29)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_29)
   goals met: 1 of 3
14. (op_1 obj_29 obj_16)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_16)
   goals met: 1 of 3
15. (op_1 obj_16 obj_12)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_12)
   goals met: 1 of 3
16. (op_1 obj_12 obj_20)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_20)
   goals met: 1 of 3
17. (op_1 obj_20 obj_23)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_23)
   goals met: 1 of 3
18. (op_1 obj_23 obj_17)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_17)
   goals met: 1 of 3
19. (op_4 obj_17 obj_27)
   deleted: (pred_4 obj_27 obj_17) (pred_12)
   added: (pred_8 obj_27)
   goals met: 1 of 3
20. (op_1 obj_17 obj_13)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_13)
   goals met: 1 of 3
21. (op_1 obj_13 obj_11)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_11)
   goals met: 1 of 3
22. (op_5 obj_11 obj_14 obj_27)
   deleted: (pred_8 obj_27) (pred_4 obj_14 obj_11)
   added: (pred_8 obj_14) (pred_4 obj_27 obj_11)
   goals met: 1 of 3
23. (op_1 obj_11 obj_13)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_13)
   goals met: 1 of 3
24. (op_1 obj_13 obj_17)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_17)
   goals met: 1 of 3
25. (op_1 obj_17 obj_22)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_22)
   goals met: 1 of 3
26. (op_1 obj_22 obj_03)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_03)
   goals met: 1 of 3
27. (op_1 obj_03 obj_09)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_09)
   goals met: 1 of 3
28. (op_1 obj_09 obj_15)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_15)
   goals met: 1 of 3
29. (op_2 obj_15 obj_14)
   deleted: (pred_8 obj_14)
   added: (pred_12) (pred_4 obj_14 obj_15)
   goals met: 2 of 3
30. (op_1 obj_15 obj_09)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_09)
   goals met: 2 of 3
31. (op_1 obj_09 obj_03)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_03)
   goals met: 2 of 3
32. (op_1 obj_03 obj_23)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_23)
   goals met: 2 of 3
33. (op_1 obj_23 obj_20)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_20)
   goals met: 2 of 3
34. (op_1 obj_20 obj_13)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_13)
   goals met: 2 of 3
35. (op_1 obj_13 obj_11)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_11)
   goals met: 2 of 3
36. (op_4 obj_11 obj_27)
   deleted: (pred_4 obj_27 obj_11) (pred_12)
   added: (pred_8 obj_27)
   goals met: 2 of 3
37. (op_1 obj_11 obj_13)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_13)
   goals met: 2 of 3
38. (op_1 obj_13 obj_20)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_20)
   goals met: 2 of 3
39. (op_1 obj_20 obj_12)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_12)
   goals met: 2 of 3
40. (op_3 obj_12 obj_28 obj_27 obj_19)
   deleted: (pred_3 obj_28)
   added: (pred_10 obj_28)
   goals met: 2 of 3
41. (op_1 obj_12 obj_28)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_28)
   goals met: 2 of 3
42. (op_1 obj_28 obj_08)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_08)
   goals met: 2 of 3
43. (op_1 obj_08 obj_05)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_05)
   goals met: 2 of 3
44. (op_2 obj_05 obj_27)
   deleted: (pred_8 obj_27)
   added: (pred_12) (pred_4 obj_27 obj_05)
   goals met: 3 of 3
